espressif/esp-idf/components/soc/esp32c6/register/soc/soc_etm_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** SOC_ETM_CH_ENA_AD0_REG register
 *  channel enable register
 */
#define SOC_ETM_CH_ENA_AD0_REG (DR_REG_SOC_ETM_BASE + 0x0)
/** SOC_ETM_CH_ENA0 : R/WTC/WTS; bitpos: [0]; default: 0;
 *  ch0 enable
 */
#define SOC_ETM_CH_ENA0    (BIT(0))
#define SOC_ETM_CH_ENA0_M  (SOC_ETM_CH_ENA0_V << SOC_ETM_CH_ENA0_S)
#define SOC_ETM_CH_ENA0_V  0x00000001U
#define SOC_ETM_CH_ENA0_S  0
/** SOC_ETM_CH_ENA1 : R/WTC/WTS; bitpos: [1]; default: 0;
 *  ch1 enable
 */
#define SOC_ETM_CH_ENA1    (BIT(1))
#define SOC_ETM_CH_ENA1_M  (SOC_ETM_CH_ENA1_V << SOC_ETM_CH_ENA1_S)
#define SOC_ETM_CH_ENA1_V  0x00000001U
#define SOC_ETM_CH_ENA1_S  1
/** SOC_ETM_CH_ENA2 : R/WTC/WTS; bitpos: [2]; default: 0;
 *  ch2 enable
 */
#define SOC_ETM_CH_ENA2    (BIT(2))
#define SOC_ETM_CH_ENA2_M  (SOC_ETM_CH_ENA2_V << SOC_ETM_CH_ENA2_S)
#define SOC_ETM_CH_ENA2_V  0x00000001U
#define SOC_ETM_CH_ENA2_S  2
/** SOC_ETM_CH_ENA3 : R/WTC/WTS; bitpos: [3]; default: 0;
 *  ch3 enable
 */
#define SOC_ETM_CH_ENA3    (BIT(3))
#define SOC_ETM_CH_ENA3_M  (SOC_ETM_CH_ENA3_V << SOC_ETM_CH_ENA3_S)
#define SOC_ETM_CH_ENA3_V  0x00000001U
#define SOC_ETM_CH_ENA3_S  3
/** SOC_ETM_CH_ENA4 : R/WTC/WTS; bitpos: [4]; default: 0;
 *  ch4 enable
 */
#define SOC_ETM_CH_ENA4    (BIT(4))
#define SOC_ETM_CH_ENA4_M  (SOC_ETM_CH_ENA4_V << SOC_ETM_CH_ENA4_S)
#define SOC_ETM_CH_ENA4_V  0x00000001U
#define SOC_ETM_CH_ENA4_S  4
/** SOC_ETM_CH_ENA5 : R/WTC/WTS; bitpos: [5]; default: 0;
 *  ch5 enable
 */
#define SOC_ETM_CH_ENA5    (BIT(5))
#define SOC_ETM_CH_ENA5_M  (SOC_ETM_CH_ENA5_V << SOC_ETM_CH_ENA5_S)
#define SOC_ETM_CH_ENA5_V  0x00000001U
#define SOC_ETM_CH_ENA5_S  5
/** SOC_ETM_CH_ENA6 : R/WTC/WTS; bitpos: [6]; default: 0;
 *  ch6 enable
 */
#define SOC_ETM_CH_ENA6    (BIT(6))
#define SOC_ETM_CH_ENA6_M  (SOC_ETM_CH_ENA6_V << SOC_ETM_CH_ENA6_S)
#define SOC_ETM_CH_ENA6_V  0x00000001U
#define SOC_ETM_CH_ENA6_S  6
/** SOC_ETM_CH_ENA7 : R/WTC/WTS; bitpos: [7]; default: 0;
 *  ch7 enable
 */
#define SOC_ETM_CH_ENA7    (BIT(7))
#define SOC_ETM_CH_ENA7_M  (SOC_ETM_CH_ENA7_V << SOC_ETM_CH_ENA7_S)
#define SOC_ETM_CH_ENA7_V  0x00000001U
#define SOC_ETM_CH_ENA7_S  7
/** SOC_ETM_CH_ENA8 : R/WTC/WTS; bitpos: [8]; default: 0;
 *  ch8 enable
 */
#define SOC_ETM_CH_ENA8    (BIT(8))
#define SOC_ETM_CH_ENA8_M  (SOC_ETM_CH_ENA8_V << SOC_ETM_CH_ENA8_S)
#define SOC_ETM_CH_ENA8_V  0x00000001U
#define SOC_ETM_CH_ENA8_S  8
/** SOC_ETM_CH_ENA9 : R/WTC/WTS; bitpos: [9]; default: 0;
 *  ch9 enable
 */
#define SOC_ETM_CH_ENA9    (BIT(9))
#define SOC_ETM_CH_ENA9_M  (SOC_ETM_CH_ENA9_V << SOC_ETM_CH_ENA9_S)
#define SOC_ETM_CH_ENA9_V  0x00000001U
#define SOC_ETM_CH_ENA9_S  9
/** SOC_ETM_CH_ENA10 : R/WTC/WTS; bitpos: [10]; default: 0;
 *  ch10 enable
 */
#define SOC_ETM_CH_ENA10    (BIT(10))
#define SOC_ETM_CH_ENA10_M  (SOC_ETM_CH_ENA10_V << SOC_ETM_CH_ENA10_S)
#define SOC_ETM_CH_ENA10_V  0x00000001U
#define SOC_ETM_CH_ENA10_S  10
/** SOC_ETM_CH_ENA11 : R/WTC/WTS; bitpos: [11]; default: 0;
 *  ch11 enable
 */
#define SOC_ETM_CH_ENA11    (BIT(11))
#define SOC_ETM_CH_ENA11_M  (SOC_ETM_CH_ENA11_V << SOC_ETM_CH_ENA11_S)
#define SOC_ETM_CH_ENA11_V  0x00000001U
#define SOC_ETM_CH_ENA11_S  11
/** SOC_ETM_CH_ENA12 : R/WTC/WTS; bitpos: [12]; default: 0;
 *  ch12 enable
 */
#define SOC_ETM_CH_ENA12    (BIT(12))
#define SOC_ETM_CH_ENA12_M  (SOC_ETM_CH_ENA12_V << SOC_ETM_CH_ENA12_S)
#define SOC_ETM_CH_ENA12_V  0x00000001U
#define SOC_ETM_CH_ENA12_S  12
/** SOC_ETM_CH_ENA13 : R/WTC/WTS; bitpos: [13]; default: 0;
 *  ch13 enable
 */
#define SOC_ETM_CH_ENA13    (BIT(13))
#define SOC_ETM_CH_ENA13_M  (SOC_ETM_CH_ENA13_V << SOC_ETM_CH_ENA13_S)
#define SOC_ETM_CH_ENA13_V  0x00000001U
#define SOC_ETM_CH_ENA13_S  13
/** SOC_ETM_CH_ENA14 : R/WTC/WTS; bitpos: [14]; default: 0;
 *  ch14 enable
 */
#define SOC_ETM_CH_ENA14    (BIT(14))
#define SOC_ETM_CH_ENA14_M  (SOC_ETM_CH_ENA14_V << SOC_ETM_CH_ENA14_S)
#define SOC_ETM_CH_ENA14_V  0x00000001U
#define SOC_ETM_CH_ENA14_S  14
/** SOC_ETM_CH_ENA15 : R/WTC/WTS; bitpos: [15]; default: 0;
 *  ch15 enable
 */
#define SOC_ETM_CH_ENA15    (BIT(15))
#define SOC_ETM_CH_ENA15_M  (SOC_ETM_CH_ENA15_V << SOC_ETM_CH_ENA15_S)
#define SOC_ETM_CH_ENA15_V  0x00000001U
#define SOC_ETM_CH_ENA15_S  15
/** SOC_ETM_CH_ENA16 : R/WTC/WTS; bitpos: [16]; default: 0;
 *  ch16 enable
 */
#define SOC_ETM_CH_ENA16    (BIT(16))
#define SOC_ETM_CH_ENA16_M  (SOC_ETM_CH_ENA16_V << SOC_ETM_CH_ENA16_S)
#define SOC_ETM_CH_ENA16_V  0x00000001U
#define SOC_ETM_CH_ENA16_S  16
/** SOC_ETM_CH_ENA17 : R/WTC/WTS; bitpos: [17]; default: 0;
 *  ch17 enable
 */
#define SOC_ETM_CH_ENA17    (BIT(17))
#define SOC_ETM_CH_ENA17_M  (SOC_ETM_CH_ENA17_V << SOC_ETM_CH_ENA17_S)
#define SOC_ETM_CH_ENA17_V  0x00000001U
#define SOC_ETM_CH_ENA17_S  17
/** SOC_ETM_CH_ENA18 : R/WTC/WTS; bitpos: [18]; default: 0;
 *  ch18 enable
 */
#define SOC_ETM_CH_ENA18    (BIT(18))
#define SOC_ETM_CH_ENA18_M  (SOC_ETM_CH_ENA18_V << SOC_ETM_CH_ENA18_S)
#define SOC_ETM_CH_ENA18_V  0x00000001U
#define SOC_ETM_CH_ENA18_S  18
/** SOC_ETM_CH_ENA19 : R/WTC/WTS; bitpos: [19]; default: 0;
 *  ch19 enable
 */
#define SOC_ETM_CH_ENA19    (BIT(19))
#define SOC_ETM_CH_ENA19_M  (SOC_ETM_CH_ENA19_V << SOC_ETM_CH_ENA19_S)
#define SOC_ETM_CH_ENA19_V  0x00000001U
#define SOC_ETM_CH_ENA19_S  19
/** SOC_ETM_CH_ENA20 : R/WTC/WTS; bitpos: [20]; default: 0;
 *  ch20 enable
 */
#define SOC_ETM_CH_ENA20    (BIT(20))
#define SOC_ETM_CH_ENA20_M  (SOC_ETM_CH_ENA20_V << SOC_ETM_CH_ENA20_S)
#define SOC_ETM_CH_ENA20_V  0x00000001U
#define SOC_ETM_CH_ENA20_S  20
/** SOC_ETM_CH_ENA21 : R/WTC/WTS; bitpos: [21]; default: 0;
 *  ch21 enable
 */
#define SOC_ETM_CH_ENA21    (BIT(21))
#define SOC_ETM_CH_ENA21_M  (SOC_ETM_CH_ENA21_V << SOC_ETM_CH_ENA21_S)
#define SOC_ETM_CH_ENA21_V  0x00000001U
#define SOC_ETM_CH_ENA21_S  21
/** SOC_ETM_CH_ENA22 : R/WTC/WTS; bitpos: [22]; default: 0;
 *  ch22 enable
 */
#define SOC_ETM_CH_ENA22    (BIT(22))
#define SOC_ETM_CH_ENA22_M  (SOC_ETM_CH_ENA22_V << SOC_ETM_CH_ENA22_S)
#define SOC_ETM_CH_ENA22_V  0x00000001U
#define SOC_ETM_CH_ENA22_S  22
/** SOC_ETM_CH_ENA23 : R/WTC/WTS; bitpos: [23]; default: 0;
 *  ch23 enable
 */
#define SOC_ETM_CH_ENA23    (BIT(23))
#define SOC_ETM_CH_ENA23_M  (SOC_ETM_CH_ENA23_V << SOC_ETM_CH_ENA23_S)
#define SOC_ETM_CH_ENA23_V  0x00000001U
#define SOC_ETM_CH_ENA23_S  23
/** SOC_ETM_CH_ENA24 : R/WTC/WTS; bitpos: [24]; default: 0;
 *  ch24 enable
 */
#define SOC_ETM_CH_ENA24    (BIT(24))
#define SOC_ETM_CH_ENA24_M  (SOC_ETM_CH_ENA24_V << SOC_ETM_CH_ENA24_S)
#define SOC_ETM_CH_ENA24_V  0x00000001U
#define SOC_ETM_CH_ENA24_S  24
/** SOC_ETM_CH_ENA25 : R/WTC/WTS; bitpos: [25]; default: 0;
 *  ch25 enable
 */
#define SOC_ETM_CH_ENA25    (BIT(25))
#define SOC_ETM_CH_ENA25_M  (SOC_ETM_CH_ENA25_V << SOC_ETM_CH_ENA25_S)
#define SOC_ETM_CH_ENA25_V  0x00000001U
#define SOC_ETM_CH_ENA25_S  25
/** SOC_ETM_CH_ENA26 : R/WTC/WTS; bitpos: [26]; default: 0;
 *  ch26 enable
 */
#define SOC_ETM_CH_ENA26    (BIT(26))
#define SOC_ETM_CH_ENA26_M  (SOC_ETM_CH_ENA26_V << SOC_ETM_CH_ENA26_S)
#define SOC_ETM_CH_ENA26_V  0x00000001U
#define SOC_ETM_CH_ENA26_S  26
/** SOC_ETM_CH_ENA27 : R/WTC/WTS; bitpos: [27]; default: 0;
 *  ch27 enable
 */
#define SOC_ETM_CH_ENA27    (BIT(27))
#define SOC_ETM_CH_ENA27_M  (SOC_ETM_CH_ENA27_V << SOC_ETM_CH_ENA27_S)
#define SOC_ETM_CH_ENA27_V  0x00000001U
#define SOC_ETM_CH_ENA27_S  27
/** SOC_ETM_CH_ENA28 : R/WTC/WTS; bitpos: [28]; default: 0;
 *  ch28 enable
 */
#define SOC_ETM_CH_ENA28    (BIT(28))
#define SOC_ETM_CH_ENA28_M  (SOC_ETM_CH_ENA28_V << SOC_ETM_CH_ENA28_S)
#define SOC_ETM_CH_ENA28_V  0x00000001U
#define SOC_ETM_CH_ENA28_S  28
/** SOC_ETM_CH_ENA29 : R/WTC/WTS; bitpos: [29]; default: 0;
 *  ch29 enable
 */
#define SOC_ETM_CH_ENA29    (BIT(29))
#define SOC_ETM_CH_ENA29_M  (SOC_ETM_CH_ENA29_V << SOC_ETM_CH_ENA29_S)
#define SOC_ETM_CH_ENA29_V  0x00000001U
#define SOC_ETM_CH_ENA29_S  29
/** SOC_ETM_CH_ENA30 : R/WTC/WTS; bitpos: [30]; default: 0;
 *  ch30 enable
 */
#define SOC_ETM_CH_ENA30    (BIT(30))
#define SOC_ETM_CH_ENA30_M  (SOC_ETM_CH_ENA30_V << SOC_ETM_CH_ENA30_S)
#define SOC_ETM_CH_ENA30_V  0x00000001U
#define SOC_ETM_CH_ENA30_S  30
/** SOC_ETM_CH_ENA31 : R/WTC/WTS; bitpos: [31]; default: 0;
 *  ch31 enable
 */
#define SOC_ETM_CH_ENA31    (BIT(31))
#define SOC_ETM_CH_ENA31_M  (SOC_ETM_CH_ENA31_V << SOC_ETM_CH_ENA31_S)
#define SOC_ETM_CH_ENA31_V  0x00000001U
#define SOC_ETM_CH_ENA31_S  31

/** SOC_ETM_CH_ENA_AD0_SET_REG register
 *  channel enable set register
 */
#define SOC_ETM_CH_ENA_AD0_SET_REG (DR_REG_SOC_ETM_BASE + 0x4)
/** SOC_ETM_CH_SET0 : WT; bitpos: [0]; default: 0;
 *  ch0 set
 */
#define SOC_ETM_CH_SET0    (BIT(0))
#define SOC_ETM_CH_SET0_M  (SOC_ETM_CH_SET0_V << SOC_ETM_CH_SET0_S)
#define SOC_ETM_CH_SET0_V  0x00000001U
#define SOC_ETM_CH_SET0_S  0
/** SOC_ETM_CH_SET1 : WT; bitpos: [1]; default: 0;
 *  ch1 set
 */
#define SOC_ETM_CH_SET1    (BIT(1))
#define SOC_ETM_CH_SET1_M  (SOC_ETM_CH_SET1_V << SOC_ETM_CH_SET1_S)
#define SOC_ETM_CH_SET1_V  0x00000001U
#define SOC_ETM_CH_SET1_S  1
/** SOC_ETM_CH_SET2 : WT; bitpos: [2]; default: 0;
 *  ch2 set
 */
#define SOC_ETM_CH_SET2    (BIT(2))
#define SOC_ETM_CH_SET2_M  (SOC_ETM_CH_SET2_V << SOC_ETM_CH_SET2_S)
#define SOC_ETM_CH_SET2_V  0x00000001U
#define SOC_ETM_CH_SET2_S  2
/** SOC_ETM_CH_SET3 : WT; bitpos: [3]; default: 0;
 *  ch3 set
 */
#define SOC_ETM_CH_SET3    (BIT(3))
#define SOC_ETM_CH_SET3_M  (SOC_ETM_CH_SET3_V << SOC_ETM_CH_SET3_S)
#define SOC_ETM_CH_SET3_V  0x00000001U
#define SOC_ETM_CH_SET3_S  3
/** SOC_ETM_CH_SET4 : WT; bitpos: [4]; default: 0;
 *  ch4 set
 */
#define SOC_ETM_CH_SET4    (BIT(4))
#define SOC_ETM_CH_SET4_M  (SOC_ETM_CH_SET4_V << SOC_ETM_CH_SET4_S)
#define SOC_ETM_CH_SET4_V  0x00000001U
#define SOC_ETM_CH_SET4_S  4
/** SOC_ETM_CH_SET5 : WT; bitpos: [5]; default: 0;
 *  ch5 set
 */
#define SOC_ETM_CH_SET5    (BIT(5))
#define SOC_ETM_CH_SET5_M  (SOC_ETM_CH_SET5_V << SOC_ETM_CH_SET5_S)
#define SOC_ETM_CH_SET5_V  0x00000001U
#define SOC_ETM_CH_SET5_S  5
/** SOC_ETM_CH_SET6 : WT; bitpos: [6]; default: 0;
 *  ch6 set
 */
#define SOC_ETM_CH_SET6    (BIT(6))
#define SOC_ETM_CH_SET6_M  (SOC_ETM_CH_SET6_V << SOC_ETM_CH_SET6_S)
#define SOC_ETM_CH_SET6_V  0x00000001U
#define SOC_ETM_CH_SET6_S  6
/** SOC_ETM_CH_SET7 : WT; bitpos: [7]; default: 0;
 *  ch7 set
 */
#define SOC_ETM_CH_SET7    (BIT(7))
#define SOC_ETM_CH_SET7_M  (SOC_ETM_CH_SET7_V << SOC_ETM_CH_SET7_S)
#define SOC_ETM_CH_SET7_V  0x00000001U
#define SOC_ETM_CH_SET7_S  7
/** SOC_ETM_CH_SET8 : WT; bitpos: [8]; default: 0;
 *  ch8 set
 */
#define SOC_ETM_CH_SET8    (BIT(8))
#define SOC_ETM_CH_SET8_M  (SOC_ETM_CH_SET8_V << SOC_ETM_CH_SET8_S)
#define SOC_ETM_CH_SET8_V  0x00000001U
#define SOC_ETM_CH_SET8_S  8
/** SOC_ETM_CH_SET9 : WT; bitpos: [9]; default: 0;
 *  ch9 set
 */
#define SOC_ETM_CH_SET9    (BIT(9))
#define SOC_ETM_CH_SET9_M  (SOC_ETM_CH_SET9_V << SOC_ETM_CH_SET9_S)
#define SOC_ETM_CH_SET9_V  0x00000001U
#define SOC_ETM_CH_SET9_S  9
/** SOC_ETM_CH_SET10 : WT; bitpos: [10]; default: 0;
 *  ch10 set
 */
#define SOC_ETM_CH_SET10    (BIT(10))
#define SOC_ETM_CH_SET10_M  (SOC_ETM_CH_SET10_V << SOC_ETM_CH_SET10_S)
#define SOC_ETM_CH_SET10_V  0x00000001U
#define SOC_ETM_CH_SET10_S  10
/** SOC_ETM_CH_SET11 : WT; bitpos: [11]; default: 0;
 *  ch11 set
 */
#define SOC_ETM_CH_SET11    (BIT(11))
#define SOC_ETM_CH_SET11_M  (SOC_ETM_CH_SET11_V << SOC_ETM_CH_SET11_S)
#define SOC_ETM_CH_SET11_V  0x00000001U
#define SOC_ETM_CH_SET11_S  11
/** SOC_ETM_CH_SET12 : WT; bitpos: [12]; default: 0;
 *  ch12 set
 */
#define SOC_ETM_CH_SET12    (BIT(12))
#define SOC_ETM_CH_SET12_M  (SOC_ETM_CH_SET12_V << SOC_ETM_CH_SET12_S)
#define SOC_ETM_CH_SET12_V  0x00000001U
#define SOC_ETM_CH_SET12_S  12
/** SOC_ETM_CH_SET13 : WT; bitpos: [13]; default: 0;
 *  ch13 set
 */
#define SOC_ETM_CH_SET13    (BIT(13))
#define SOC_ETM_CH_SET13_M  (SOC_ETM_CH_SET13_V << SOC_ETM_CH_SET13_S)
#define SOC_ETM_CH_SET13_V  0x00000001U
#define SOC_ETM_CH_SET13_S  13
/** SOC_ETM_CH_SET14 : WT; bitpos: [14]; default: 0;
 *  ch14 set
 */
#define SOC_ETM_CH_SET14    (BIT(14))
#define SOC_ETM_CH_SET14_M  (SOC_ETM_CH_SET14_V << SOC_ETM_CH_SET14_S)
#define SOC_ETM_CH_SET14_V  0x00000001U
#define SOC_ETM_CH_SET14_S  14
/** SOC_ETM_CH_SET15 : WT; bitpos: [15]; default: 0;
 *  ch15 set
 */
#define SOC_ETM_CH_SET15    (BIT(15))
#define SOC_ETM_CH_SET15_M  (SOC_ETM_CH_SET15_V << SOC_ETM_CH_SET15_S)
#define SOC_ETM_CH_SET15_V  0x00000001U
#define SOC_ETM_CH_SET15_S  15
/** SOC_ETM_CH_SET16 : WT; bitpos: [16]; default: 0;
 *  ch16 set
 */
#define SOC_ETM_CH_SET16    (BIT(16))
#define SOC_ETM_CH_SET16_M  (SOC_ETM_CH_SET16_V << SOC_ETM_CH_SET16_S)
#define SOC_ETM_CH_SET16_V  0x00000001U
#define SOC_ETM_CH_SET16_S  16
/** SOC_ETM_CH_SET17 : WT; bitpos: [17]; default: 0;
 *  ch17 set
 */
#define SOC_ETM_CH_SET17    (BIT(17))
#define SOC_ETM_CH_SET17_M  (SOC_ETM_CH_SET17_V << SOC_ETM_CH_SET17_S)
#define SOC_ETM_CH_SET17_V  0x00000001U
#define SOC_ETM_CH_SET17_S  17
/** SOC_ETM_CH_SET18 : WT; bitpos: [18]; default: 0;
 *  ch18 set
 */
#define SOC_ETM_CH_SET18    (BIT(18))
#define SOC_ETM_CH_SET18_M  (SOC_ETM_CH_SET18_V << SOC_ETM_CH_SET18_S)
#define SOC_ETM_CH_SET18_V  0x00000001U
#define SOC_ETM_CH_SET18_S  18
/** SOC_ETM_CH_SET19 : WT; bitpos: [19]; default: 0;
 *  ch19 set
 */
#define SOC_ETM_CH_SET19    (BIT(19))
#define SOC_ETM_CH_SET19_M  (SOC_ETM_CH_SET19_V << SOC_ETM_CH_SET19_S)
#define SOC_ETM_CH_SET19_V  0x00000001U
#define SOC_ETM_CH_SET19_S  19
/** SOC_ETM_CH_SET20 : WT; bitpos: [20]; default: 0;
 *  ch20 set
 */
#define SOC_ETM_CH_SET20    (BIT(20))
#define SOC_ETM_CH_SET20_M  (SOC_ETM_CH_SET20_V << SOC_ETM_CH_SET20_S)
#define SOC_ETM_CH_SET20_V  0x00000001U
#define SOC_ETM_CH_SET20_S  20
/** SOC_ETM_CH_SET21 : WT; bitpos: [21]; default: 0;
 *  ch21 set
 */
#define SOC_ETM_CH_SET21    (BIT(21))
#define SOC_ETM_CH_SET21_M  (SOC_ETM_CH_SET21_V << SOC_ETM_CH_SET21_S)
#define SOC_ETM_CH_SET21_V  0x00000001U
#define SOC_ETM_CH_SET21_S  21
/** SOC_ETM_CH_SET22 : WT; bitpos: [22]; default: 0;
 *  ch22 set
 */
#define SOC_ETM_CH_SET22    (BIT(22))
#define SOC_ETM_CH_SET22_M  (SOC_ETM_CH_SET22_V << SOC_ETM_CH_SET22_S)
#define SOC_ETM_CH_SET22_V  0x00000001U
#define SOC_ETM_CH_SET22_S  22
/** SOC_ETM_CH_SET23 : WT; bitpos: [23]; default: 0;
 *  ch23 set
 */
#define SOC_ETM_CH_SET23    (BIT(23))
#define SOC_ETM_CH_SET23_M  (SOC_ETM_CH_SET23_V << SOC_ETM_CH_SET23_S)
#define SOC_ETM_CH_SET23_V  0x00000001U
#define SOC_ETM_CH_SET23_S  23
/** SOC_ETM_CH_SET24 : WT; bitpos: [24]; default: 0;
 *  ch24 set
 */
#define SOC_ETM_CH_SET24    (BIT(24))
#define SOC_ETM_CH_SET24_M  (SOC_ETM_CH_SET24_V << SOC_ETM_CH_SET24_S)
#define SOC_ETM_CH_SET24_V  0x00000001U
#define SOC_ETM_CH_SET24_S  24
/** SOC_ETM_CH_SET25 : WT; bitpos: [25]; default: 0;
 *  ch25 set
 */
#define SOC_ETM_CH_SET25    (BIT(25))
#define SOC_ETM_CH_SET25_M  (SOC_ETM_CH_SET25_V << SOC_ETM_CH_SET25_S)
#define SOC_ETM_CH_SET25_V  0x00000001U
#define SOC_ETM_CH_SET25_S  25
/** SOC_ETM_CH_SET26 : WT; bitpos: [26]; default: 0;
 *  ch26 set
 */
#define SOC_ETM_CH_SET26    (BIT(26))
#define SOC_ETM_CH_SET26_M  (SOC_ETM_CH_SET26_V << SOC_ETM_CH_SET26_S)
#define SOC_ETM_CH_SET26_V  0x00000001U
#define SOC_ETM_CH_SET26_S  26
/** SOC_ETM_CH_SET27 : WT; bitpos: [27]; default: 0;
 *  ch27 set
 */
#define SOC_ETM_CH_SET27    (BIT(27))
#define SOC_ETM_CH_SET27_M  (SOC_ETM_CH_SET27_V << SOC_ETM_CH_SET27_S)
#define SOC_ETM_CH_SET27_V  0x00000001U
#define SOC_ETM_CH_SET27_S  27
/** SOC_ETM_CH_SET28 : WT; bitpos: [28]; default: 0;
 *  ch28 set
 */
#define SOC_ETM_CH_SET28    (BIT(28))
#define SOC_ETM_CH_SET28_M  (SOC_ETM_CH_SET28_V << SOC_ETM_CH_SET28_S)
#define SOC_ETM_CH_SET28_V  0x00000001U
#define SOC_ETM_CH_SET28_S  28
/** SOC_ETM_CH_SET29 : WT; bitpos: [29]; default: 0;
 *  ch29 set
 */
#define SOC_ETM_CH_SET29    (BIT(29))
#define SOC_ETM_CH_SET29_M  (SOC_ETM_CH_SET29_V << SOC_ETM_CH_SET29_S)
#define SOC_ETM_CH_SET29_V  0x00000001U
#define SOC_ETM_CH_SET29_S  29
/** SOC_ETM_CH_SET30 : WT; bitpos: [30]; default: 0;
 *  ch30 set
 */
#define SOC_ETM_CH_SET30    (BIT(30))
#define SOC_ETM_CH_SET30_M  (SOC_ETM_CH_SET30_V << SOC_ETM_CH_SET30_S)
#define SOC_ETM_CH_SET30_V  0x00000001U
#define SOC_ETM_CH_SET30_S  30
/** SOC_ETM_CH_SET31 : WT; bitpos: [31]; default: 0;
 *  ch31 set
 */
#define SOC_ETM_CH_SET31    (BIT(31))
#define SOC_ETM_CH_SET31_M  (SOC_ETM_CH_SET31_V << SOC_ETM_CH_SET31_S)
#define SOC_ETM_CH_SET31_V  0x00000001U
#define SOC_ETM_CH_SET31_S  31

