espressif/esp-idf/components/soc/esp32c6/register/soc/soc_etm_reg.h
/** SOC_ETM_CH_ENA_AD0_CLR_REG register
 *  channel enable clear register
 */
#define SOC_ETM_CH_ENA_AD0_CLR_REG (DR_REG_SOC_ETM_BASE + 0x8)
/** SOC_ETM_CH_CLR0 : WT; bitpos: [0]; default: 0;
 *  ch0 clear
 */
#define SOC_ETM_CH_CLR0    (BIT(0))
#define SOC_ETM_CH_CLR0_M  (SOC_ETM_CH_CLR0_V << SOC_ETM_CH_CLR0_S)
#define SOC_ETM_CH_CLR0_V  0x00000001U
#define SOC_ETM_CH_CLR0_S  0
/** SOC_ETM_CH_CLR1 : WT; bitpos: [1]; default: 0;
 *  ch1 clear
 */
#define SOC_ETM_CH_CLR1    (BIT(1))
#define SOC_ETM_CH_CLR1_M  (SOC_ETM_CH_CLR1_V << SOC_ETM_CH_CLR1_S)
#define SOC_ETM_CH_CLR1_V  0x00000001U
#define SOC_ETM_CH_CLR1_S  1
/** SOC_ETM_CH_CLR2 : WT; bitpos: [2]; default: 0;
 *  ch2 clear
 */
#define SOC_ETM_CH_CLR2    (BIT(2))
#define SOC_ETM_CH_CLR2_M  (SOC_ETM_CH_CLR2_V << SOC_ETM_CH_CLR2_S)
#define SOC_ETM_CH_CLR2_V  0x00000001U
#define SOC_ETM_CH_CLR2_S  2
/** SOC_ETM_CH_CLR3 : WT; bitpos: [3]; default: 0;
 *  ch3 clear
 */
#define SOC_ETM_CH_CLR3    (BIT(3))
#define SOC_ETM_CH_CLR3_M  (SOC_ETM_CH_CLR3_V << SOC_ETM_CH_CLR3_S)
#define SOC_ETM_CH_CLR3_V  0x00000001U
#define SOC_ETM_CH_CLR3_S  3
/** SOC_ETM_CH_CLR4 : WT; bitpos: [4]; default: 0;
 *  ch4 clear
 */
#define SOC_ETM_CH_CLR4    (BIT(4))
#define SOC_ETM_CH_CLR4_M  (SOC_ETM_CH_CLR4_V << SOC_ETM_CH_CLR4_S)
#define SOC_ETM_CH_CLR4_V  0x00000001U
#define SOC_ETM_CH_CLR4_S  4
/** SOC_ETM_CH_CLR5 : WT; bitpos: [5]; default: 0;
 *  ch5 clear
 */
#define SOC_ETM_CH_CLR5    (BIT(5))
#define SOC_ETM_CH_CLR5_M  (SOC_ETM_CH_CLR5_V << SOC_ETM_CH_CLR5_S)
#define SOC_ETM_CH_CLR5_V  0x00000001U
#define SOC_ETM_CH_CLR5_S  5
/** SOC_ETM_CH_CLR6 : WT; bitpos: [6]; default: 0;
 *  ch6 clear
 */
#define SOC_ETM_CH_CLR6    (BIT(6))
#define SOC_ETM_CH_CLR6_M  (SOC_ETM_CH_CLR6_V << SOC_ETM_CH_CLR6_S)
#define SOC_ETM_CH_CLR6_V  0x00000001U
#define SOC_ETM_CH_CLR6_S  6
/** SOC_ETM_CH_CLR7 : WT; bitpos: [7]; default: 0;
 *  ch7 clear
 */
#define SOC_ETM_CH_CLR7    (BIT(7))
#define SOC_ETM_CH_CLR7_M  (SOC_ETM_CH_CLR7_V << SOC_ETM_CH_CLR7_S)
#define SOC_ETM_CH_CLR7_V  0x00000001U
#define SOC_ETM_CH_CLR7_S  7
/** SOC_ETM_CH_CLR8 : WT; bitpos: [8]; default: 0;
 *  ch8 clear
 */
#define SOC_ETM_CH_CLR8    (BIT(8))
#define SOC_ETM_CH_CLR8_M  (SOC_ETM_CH_CLR8_V << SOC_ETM_CH_CLR8_S)
#define SOC_ETM_CH_CLR8_V  0x00000001U
#define SOC_ETM_CH_CLR8_S  8
/** SOC_ETM_CH_CLR9 : WT; bitpos: [9]; default: 0;
 *  ch9 clear
 */
#define SOC_ETM_CH_CLR9    (BIT(9))
#define SOC_ETM_CH_CLR9_M  (SOC_ETM_CH_CLR9_V << SOC_ETM_CH_CLR9_S)
#define SOC_ETM_CH_CLR9_V  0x00000001U
#define SOC_ETM_CH_CLR9_S  9
/** SOC_ETM_CH_CLR10 : WT; bitpos: [10]; default: 0;
 *  ch10 clear
 */
#define SOC_ETM_CH_CLR10    (BIT(10))
#define SOC_ETM_CH_CLR10_M  (SOC_ETM_CH_CLR10_V << SOC_ETM_CH_CLR10_S)
#define SOC_ETM_CH_CLR10_V  0x00000001U
#define SOC_ETM_CH_CLR10_S  10
/** SOC_ETM_CH_CLR11 : WT; bitpos: [11]; default: 0;
 *  ch11 clear
 */
#define SOC_ETM_CH_CLR11    (BIT(11))
#define SOC_ETM_CH_CLR11_M  (SOC_ETM_CH_CLR11_V << SOC_ETM_CH_CLR11_S)
#define SOC_ETM_CH_CLR11_V  0x00000001U
#define SOC_ETM_CH_CLR11_S  11
/** SOC_ETM_CH_CLR12 : WT; bitpos: [12]; default: 0;
 *  ch12 clear
 */
#define SOC_ETM_CH_CLR12    (BIT(12))
#define SOC_ETM_CH_CLR12_M  (SOC_ETM_CH_CLR12_V << SOC_ETM_CH_CLR12_S)
#define SOC_ETM_CH_CLR12_V  0x00000001U
#define SOC_ETM_CH_CLR12_S  12
/** SOC_ETM_CH_CLR13 : WT; bitpos: [13]; default: 0;
 *  ch13 clear
 */
#define SOC_ETM_CH_CLR13    (BIT(13))
#define SOC_ETM_CH_CLR13_M  (SOC_ETM_CH_CLR13_V << SOC_ETM_CH_CLR13_S)
#define SOC_ETM_CH_CLR13_V  0x00000001U
#define SOC_ETM_CH_CLR13_S  13
/** SOC_ETM_CH_CLR14 : WT; bitpos: [14]; default: 0;
 *  ch14 clear
 */
#define SOC_ETM_CH_CLR14    (BIT(14))
#define SOC_ETM_CH_CLR14_M  (SOC_ETM_CH_CLR14_V << SOC_ETM_CH_CLR14_S)
#define SOC_ETM_CH_CLR14_V  0x00000001U
#define SOC_ETM_CH_CLR14_S  14
/** SOC_ETM_CH_CLR15 : WT; bitpos: [15]; default: 0;
 *  ch15 clear
 */
#define SOC_ETM_CH_CLR15    (BIT(15))
#define SOC_ETM_CH_CLR15_M  (SOC_ETM_CH_CLR15_V << SOC_ETM_CH_CLR15_S)
#define SOC_ETM_CH_CLR15_V  0x00000001U
#define SOC_ETM_CH_CLR15_S  15
/** SOC_ETM_CH_CLR16 : WT; bitpos: [16]; default: 0;
 *  ch16 clear
 */
#define SOC_ETM_CH_CLR16    (BIT(16))
#define SOC_ETM_CH_CLR16_M  (SOC_ETM_CH_CLR16_V << SOC_ETM_CH_CLR16_S)
#define SOC_ETM_CH_CLR16_V  0x00000001U
#define SOC_ETM_CH_CLR16_S  16
/** SOC_ETM_CH_CLR17 : WT; bitpos: [17]; default: 0;
 *  ch17 clear
 */
#define SOC_ETM_CH_CLR17    (BIT(17))
#define SOC_ETM_CH_CLR17_M  (SOC_ETM_CH_CLR17_V << SOC_ETM_CH_CLR17_S)
#define SOC_ETM_CH_CLR17_V  0x00000001U
#define SOC_ETM_CH_CLR17_S  17
/** SOC_ETM_CH_CLR18 : WT; bitpos: [18]; default: 0;
 *  ch18 clear
 */
#define SOC_ETM_CH_CLR18    (BIT(18))
#define SOC_ETM_CH_CLR18_M  (SOC_ETM_CH_CLR18_V << SOC_ETM_CH_CLR18_S)
#define SOC_ETM_CH_CLR18_V  0x00000001U
#define SOC_ETM_CH_CLR18_S  18
/** SOC_ETM_CH_CLR19 : WT; bitpos: [19]; default: 0;
 *  ch19 clear
 */
#define SOC_ETM_CH_CLR19    (BIT(19))
#define SOC_ETM_CH_CLR19_M  (SOC_ETM_CH_CLR19_V << SOC_ETM_CH_CLR19_S)
#define SOC_ETM_CH_CLR19_V  0x00000001U
#define SOC_ETM_CH_CLR19_S  19
/** SOC_ETM_CH_CLR20 : WT; bitpos: [20]; default: 0;
 *  ch20 clear
 */
#define SOC_ETM_CH_CLR20    (BIT(20))
#define SOC_ETM_CH_CLR20_M  (SOC_ETM_CH_CLR20_V << SOC_ETM_CH_CLR20_S)
#define SOC_ETM_CH_CLR20_V  0x00000001U
#define SOC_ETM_CH_CLR20_S  20
/** SOC_ETM_CH_CLR21 : WT; bitpos: [21]; default: 0;
 *  ch21 clear
 */
#define SOC_ETM_CH_CLR21    (BIT(21))
#define SOC_ETM_CH_CLR21_M  (SOC_ETM_CH_CLR21_V << SOC_ETM_CH_CLR21_S)
#define SOC_ETM_CH_CLR21_V  0x00000001U
#define SOC_ETM_CH_CLR21_S  21
/** SOC_ETM_CH_CLR22 : WT; bitpos: [22]; default: 0;
 *  ch22 clear
 */
#define SOC_ETM_CH_CLR22    (BIT(22))
#define SOC_ETM_CH_CLR22_M  (SOC_ETM_CH_CLR22_V << SOC_ETM_CH_CLR22_S)
#define SOC_ETM_CH_CLR22_V  0x00000001U
#define SOC_ETM_CH_CLR22_S  22
/** SOC_ETM_CH_CLR23 : WT; bitpos: [23]; default: 0;
 *  ch23 clear
 */
#define SOC_ETM_CH_CLR23    (BIT(23))
#define SOC_ETM_CH_CLR23_M  (SOC_ETM_CH_CLR23_V << SOC_ETM_CH_CLR23_S)
#define SOC_ETM_CH_CLR23_V  0x00000001U
#define SOC_ETM_CH_CLR23_S  23
/** SOC_ETM_CH_CLR24 : WT; bitpos: [24]; default: 0;
 *  ch24 clear
 */
#define SOC_ETM_CH_CLR24    (BIT(24))
#define SOC_ETM_CH_CLR24_M  (SOC_ETM_CH_CLR24_V << SOC_ETM_CH_CLR24_S)
#define SOC_ETM_CH_CLR24_V  0x00000001U
#define SOC_ETM_CH_CLR24_S  24
/** SOC_ETM_CH_CLR25 : WT; bitpos: [25]; default: 0;
 *  ch25 clear
 */
#define SOC_ETM_CH_CLR25    (BIT(25))
#define SOC_ETM_CH_CLR25_M  (SOC_ETM_CH_CLR25_V << SOC_ETM_CH_CLR25_S)
#define SOC_ETM_CH_CLR25_V  0x00000001U
#define SOC_ETM_CH_CLR25_S  25
/** SOC_ETM_CH_CLR26 : WT; bitpos: [26]; default: 0;
 *  ch26 clear
 */
#define SOC_ETM_CH_CLR26    (BIT(26))
#define SOC_ETM_CH_CLR26_M  (SOC_ETM_CH_CLR26_V << SOC_ETM_CH_CLR26_S)
#define SOC_ETM_CH_CLR26_V  0x00000001U
#define SOC_ETM_CH_CLR26_S  26
/** SOC_ETM_CH_CLR27 : WT; bitpos: [27]; default: 0;
 *  ch27 clear
 */
#define SOC_ETM_CH_CLR27    (BIT(27))
#define SOC_ETM_CH_CLR27_M  (SOC_ETM_CH_CLR27_V << SOC_ETM_CH_CLR27_S)
#define SOC_ETM_CH_CLR27_V  0x00000001U
#define SOC_ETM_CH_CLR27_S  27
/** SOC_ETM_CH_CLR28 : WT; bitpos: [28]; default: 0;
 *  ch28 clear
 */
#define SOC_ETM_CH_CLR28    (BIT(28))
#define SOC_ETM_CH_CLR28_M  (SOC_ETM_CH_CLR28_V << SOC_ETM_CH_CLR28_S)
#define SOC_ETM_CH_CLR28_V  0x00000001U
#define SOC_ETM_CH_CLR28_S  28
/** SOC_ETM_CH_CLR29 : WT; bitpos: [29]; default: 0;
 *  ch29 clear
 */
#define SOC_ETM_CH_CLR29    (BIT(29))
#define SOC_ETM_CH_CLR29_M  (SOC_ETM_CH_CLR29_V << SOC_ETM_CH_CLR29_S)
#define SOC_ETM_CH_CLR29_V  0x00000001U
#define SOC_ETM_CH_CLR29_S  29
/** SOC_ETM_CH_CLR30 : WT; bitpos: [30]; default: 0;
 *  ch30 clear
 */
#define SOC_ETM_CH_CLR30    (BIT(30))
#define SOC_ETM_CH_CLR30_M  (SOC_ETM_CH_CLR30_V << SOC_ETM_CH_CLR30_S)
#define SOC_ETM_CH_CLR30_V  0x00000001U
#define SOC_ETM_CH_CLR30_S  30
/** SOC_ETM_CH_CLR31 : WT; bitpos: [31]; default: 0;
 *  ch31 clear
 */
#define SOC_ETM_CH_CLR31    (BIT(31))
#define SOC_ETM_CH_CLR31_M  (SOC_ETM_CH_CLR31_V << SOC_ETM_CH_CLR31_S)
#define SOC_ETM_CH_CLR31_V  0x00000001U
#define SOC_ETM_CH_CLR31_S  31

/** SOC_ETM_CH_ENA_AD1_REG register
 *  channel enable register
 */
#define SOC_ETM_CH_ENA_AD1_REG (DR_REG_SOC_ETM_BASE + 0xc)
/** SOC_ETM_CH_ENA32 : R/WTC/WTS; bitpos: [0]; default: 0;
 *  ch32 enable
 */
#define SOC_ETM_CH_ENA32    (BIT(0))
#define SOC_ETM_CH_ENA32_M  (SOC_ETM_CH_ENA32_V << SOC_ETM_CH_ENA32_S)
#define SOC_ETM_CH_ENA32_V  0x00000001U
#define SOC_ETM_CH_ENA32_S  0
/** SOC_ETM_CH_ENA33 : R/WTC/WTS; bitpos: [1]; default: 0;
 *  ch33 enable
 */
#define SOC_ETM_CH_ENA33    (BIT(1))
#define SOC_ETM_CH_ENA33_M  (SOC_ETM_CH_ENA33_V << SOC_ETM_CH_ENA33_S)
#define SOC_ETM_CH_ENA33_V  0x00000001U
#define SOC_ETM_CH_ENA33_S  1
/** SOC_ETM_CH_ENA34 : R/WTC/WTS; bitpos: [2]; default: 0;
 *  ch34 enable
 */
#define SOC_ETM_CH_ENA34    (BIT(2))
#define SOC_ETM_CH_ENA34_M  (SOC_ETM_CH_ENA34_V << SOC_ETM_CH_ENA34_S)
#define SOC_ETM_CH_ENA34_V  0x00000001U
#define SOC_ETM_CH_ENA34_S  2
/** SOC_ETM_CH_ENA35 : R/WTC/WTS; bitpos: [3]; default: 0;
 *  ch35 enable
 */
#define SOC_ETM_CH_ENA35    (BIT(3))
#define SOC_ETM_CH_ENA35_M  (SOC_ETM_CH_ENA35_V << SOC_ETM_CH_ENA35_S)
#define SOC_ETM_CH_ENA35_V  0x00000001U
#define SOC_ETM_CH_ENA35_S  3
/** SOC_ETM_CH_ENA36 : R/WTC/WTS; bitpos: [4]; default: 0;
 *  ch36 enable
 */
#define SOC_ETM_CH_ENA36    (BIT(4))
#define SOC_ETM_CH_ENA36_M  (SOC_ETM_CH_ENA36_V << SOC_ETM_CH_ENA36_S)
#define SOC_ETM_CH_ENA36_V  0x00000001U
#define SOC_ETM_CH_ENA36_S  4
/** SOC_ETM_CH_ENA37 : R/WTC/WTS; bitpos: [5]; default: 0;
 *  ch37 enable
 */
#define SOC_ETM_CH_ENA37    (BIT(5))
#define SOC_ETM_CH_ENA37_M  (SOC_ETM_CH_ENA37_V << SOC_ETM_CH_ENA37_S)
#define SOC_ETM_CH_ENA37_V  0x00000001U
#define SOC_ETM_CH_ENA37_S  5
/** SOC_ETM_CH_ENA38 : R/WTC/WTS; bitpos: [6]; default: 0;
 *  ch38 enable
 */
#define SOC_ETM_CH_ENA38    (BIT(6))
#define SOC_ETM_CH_ENA38_M  (SOC_ETM_CH_ENA38_V << SOC_ETM_CH_ENA38_S)
#define SOC_ETM_CH_ENA38_V  0x00000001U
#define SOC_ETM_CH_ENA38_S  6
/** SOC_ETM_CH_ENA39 : R/WTC/WTS; bitpos: [7]; default: 0;
 *  ch39 enable
 */
#define SOC_ETM_CH_ENA39    (BIT(7))
#define SOC_ETM_CH_ENA39_M  (SOC_ETM_CH_ENA39_V << SOC_ETM_CH_ENA39_S)
#define SOC_ETM_CH_ENA39_V  0x00000001U
#define SOC_ETM_CH_ENA39_S  7
/** SOC_ETM_CH_ENA40 : R/WTC/WTS; bitpos: [8]; default: 0;
 *  ch40 enable
 */
#define SOC_ETM_CH_ENA40    (BIT(8))
#define SOC_ETM_CH_ENA40_M  (SOC_ETM_CH_ENA40_V << SOC_ETM_CH_ENA40_S)
#define SOC_ETM_CH_ENA40_V  0x00000001U
#define SOC_ETM_CH_ENA40_S  8
/** SOC_ETM_CH_ENA41 : R/WTC/WTS; bitpos: [9]; default: 0;
 *  ch41 enable
 */
#define SOC_ETM_CH_ENA41    (BIT(9))
#define SOC_ETM_CH_ENA41_M  (SOC_ETM_CH_ENA41_V << SOC_ETM_CH_ENA41_S)
#define SOC_ETM_CH_ENA41_V  0x00000001U
#define SOC_ETM_CH_ENA41_S  9
/** SOC_ETM_CH_ENA42 : R/WTC/WTS; bitpos: [10]; default: 0;
 *  ch42 enable
 */
#define SOC_ETM_CH_ENA42    (BIT(10))
#define SOC_ETM_CH_ENA42_M  (SOC_ETM_CH_ENA42_V << SOC_ETM_CH_ENA42_S)
#define SOC_ETM_CH_ENA42_V  0x00000001U
#define SOC_ETM_CH_ENA42_S  10
/** SOC_ETM_CH_ENA43 : R/WTC/WTS; bitpos: [11]; default: 0;
 *  ch43 enable
 */
#define SOC_ETM_CH_ENA43    (BIT(11))
#define SOC_ETM_CH_ENA43_M  (SOC_ETM_CH_ENA43_V << SOC_ETM_CH_ENA43_S)
#define SOC_ETM_CH_ENA43_V  0x00000001U
#define SOC_ETM_CH_ENA43_S  11
/** SOC_ETM_CH_ENA44 : R/WTC/WTS; bitpos: [12]; default: 0;
 *  ch44 enable
 */
#define SOC_ETM_CH_ENA44    (BIT(12))
#define SOC_ETM_CH_ENA44_M  (SOC_ETM_CH_ENA44_V << SOC_ETM_CH_ENA44_S)
#define SOC_ETM_CH_ENA44_V  0x00000001U
#define SOC_ETM_CH_ENA44_S  12
/** SOC_ETM_CH_ENA45 : R/WTC/WTS; bitpos: [13]; default: 0;
 *  ch45 enable
 */
#define SOC_ETM_CH_ENA45    (BIT(13))
#define SOC_ETM_CH_ENA45_M  (SOC_ETM_CH_ENA45_V << SOC_ETM_CH_ENA45_S)
#define SOC_ETM_CH_ENA45_V  0x00000001U
#define SOC_ETM_CH_ENA45_S  13
/** SOC_ETM_CH_ENA46 : R/WTC/WTS; bitpos: [14]; default: 0;
 *  ch46 enable
 */
#define SOC_ETM_CH_ENA46    (BIT(14))
#define SOC_ETM_CH_ENA46_M  (SOC_ETM_CH_ENA46_V << SOC_ETM_CH_ENA46_S)
#define SOC_ETM_CH_ENA46_V  0x00000001U
#define SOC_ETM_CH_ENA46_S  14
/** SOC_ETM_CH_ENA47 : R/WTC/WTS; bitpos: [15]; default: 0;
 *  ch47 enable
 */
#define SOC_ETM_CH_ENA47    (BIT(15))
#define SOC_ETM_CH_ENA47_M  (SOC_ETM_CH_ENA47_V << SOC_ETM_CH_ENA47_S)
#define SOC_ETM_CH_ENA47_V  0x00000001U
#define SOC_ETM_CH_ENA47_S  15
/** SOC_ETM_CH_ENA48 : R/WTC/WTS; bitpos: [16]; default: 0;
 *  ch48 enable
 */
#define SOC_ETM_CH_ENA48    (BIT(16))
#define SOC_ETM_CH_ENA48_M  (SOC_ETM_CH_ENA48_V << SOC_ETM_CH_ENA48_S)
#define SOC_ETM_CH_ENA48_V  0x00000001U
#define SOC_ETM_CH_ENA48_S  16
/** SOC_ETM_CH_ENA49 : R/WTC/WTS; bitpos: [17]; default: 0;
 *  ch49 enable
 */
#define SOC_ETM_CH_ENA49    (BIT(17))
#define SOC_ETM_CH_ENA49_M  (SOC_ETM_CH_ENA49_V << SOC_ETM_CH_ENA49_S)
#define SOC_ETM_CH_ENA49_V  0x00000001U
#define SOC_ETM_CH_ENA49_S  17

/** SOC_ETM_CH_ENA_AD1_SET_REG register
 *  channel enable set register
 */
#define SOC_ETM_CH_ENA_AD1_SET_REG (DR_REG_SOC_ETM_BASE + 0x10)
/** SOC_ETM_CH_SET32 : WT; bitpos: [0]; default: 0;
 *  ch32 set
 */
#define SOC_ETM_CH_SET32    (BIT(0))
#define SOC_ETM_CH_SET32_M  (SOC_ETM_CH_SET32_V << SOC_ETM_CH_SET32_S)
#define SOC_ETM_CH_SET32_V  0x00000001U
#define SOC_ETM_CH_SET32_S  0
/** SOC_ETM_CH_SET33 : WT; bitpos: [1]; default: 0;
 *  ch33 set
 */
#define SOC_ETM_CH_SET33    (BIT(1))
#define SOC_ETM_CH_SET33_M  (SOC_ETM_CH_SET33_V << SOC_ETM_CH_SET33_S)
#define SOC_ETM_CH_SET33_V  0x00000001U
#define SOC_ETM_CH_SET33_S  1
/** SOC_ETM_CH_SET34 : WT; bitpos: [2]; default: 0;
 *  ch34 set
 */
#define SOC_ETM_CH_SET34    (BIT(2))
#define SOC_ETM_CH_SET34_M  (SOC_ETM_CH_SET34_V << SOC_ETM_CH_SET34_S)
#define SOC_ETM_CH_SET34_V  0x00000001U
#define SOC_ETM_CH_SET34_S  2
/** SOC_ETM_CH_SET35 : WT; bitpos: [3]; default: 0;
 *  ch35 set
 */
#define SOC_ETM_CH_SET35    (BIT(3))
#define SOC_ETM_CH_SET35_M  (SOC_ETM_CH_SET35_V << SOC_ETM_CH_SET35_S)
#define SOC_ETM_CH_SET35_V  0x00000001U
#define SOC_ETM_CH_SET35_S  3
/** SOC_ETM_CH_SET36 : WT; bitpos: [4]; default: 0;
 *  ch36 set
 */
#define SOC_ETM_CH_SET36    (BIT(4))
#define SOC_ETM_CH_SET36_M  (SOC_ETM_CH_SET36_V << SOC_ETM_CH_SET36_S)
#define SOC_ETM_CH_SET36_V  0x00000001U
#define SOC_ETM_CH_SET36_S  4
/** SOC_ETM_CH_SET37 : WT; bitpos: [5]; default: 0;
 *  ch37 set
 */
#define SOC_ETM_CH_SET37    (BIT(5))
#define SOC_ETM_CH_SET37_M  (SOC_ETM_CH_SET37_V << SOC_ETM_CH_SET37_S)
#define SOC_ETM_CH_SET37_V  0x00000001U
#define SOC_ETM_CH_SET37_S  5
/** SOC_ETM_CH_SET38 : WT; bitpos: [6]; default: 0;
 *  ch38 set
 */
#define SOC_ETM_CH_SET38    (BIT(6))
#define SOC_ETM_CH_SET38_M  (SOC_ETM_CH_SET38_V << SOC_ETM_CH_SET38_S)
#define SOC_ETM_CH_SET38_V  0x00000001U
#define SOC_ETM_CH_SET38_S  6
/** SOC_ETM_CH_SET39 : WT; bitpos: [7]; default: 0;
 *  ch39 set
 */
#define SOC_ETM_CH_SET39    (BIT(7))
#define SOC_ETM_CH_SET39_M  (SOC_ETM_CH_SET39_V << SOC_ETM_CH_SET39_S)
#define SOC_ETM_CH_SET39_V  0x00000001U
#define SOC_ETM_CH_SET39_S  7
/** SOC_ETM_CH_SET40 : WT; bitpos: [8]; default: 0;
 *  ch40 set
 */
#define SOC_ETM_CH_SET40    (BIT(8))
#define SOC_ETM_CH_SET40_M  (SOC_ETM_CH_SET40_V << SOC_ETM_CH_SET40_S)
#define SOC_ETM_CH_SET40_V  0x00000001U
#define SOC_ETM_CH_SET40_S  8
/** SOC_ETM_CH_SET41 : WT; bitpos: [9]; default: 0;
 *  ch41 set
 */
#define SOC_ETM_CH_SET41    (BIT(9))
#define SOC_ETM_CH_SET41_M  (SOC_ETM_CH_SET41_V << SOC_ETM_CH_SET41_S)
#define SOC_ETM_CH_SET41_V  0x00000001U
#define SOC_ETM_CH_SET41_S  9
/** SOC_ETM_CH_SET42 : WT; bitpos: [10]; default: 0;
 *  ch42 set
 */
#define SOC_ETM_CH_SET42    (BIT(10))
#define SOC_ETM_CH_SET42_M  (SOC_ETM_CH_SET42_V << SOC_ETM_CH_SET42_S)
#define SOC_ETM_CH_SET42_V  0x00000001U
#define SOC_ETM_CH_SET42_S  10
/** SOC_ETM_CH_SET43 : WT; bitpos: [11]; default: 0;
 *  ch43 set
 */
#define SOC_ETM_CH_SET43    (BIT(11))
#define SOC_ETM_CH_SET43_M  (SOC_ETM_CH_SET43_V << SOC_ETM_CH_SET43_S)
#define SOC_ETM_CH_SET43_V  0x00000001U
#define SOC_ETM_CH_SET43_S  11
/** SOC_ETM_CH_SET44 : WT; bitpos: [12]; default: 0;
 *  ch44 set
 */
#define SOC_ETM_CH_SET44    (BIT(12))
#define SOC_ETM_CH_SET44_M  (SOC_ETM_CH_SET44_V << SOC_ETM_CH_SET44_S)
#define SOC_ETM_CH_SET44_V  0x00000001U
#define SOC_ETM_CH_SET44_S  12
/** SOC_ETM_CH_SET45 : WT; bitpos: [13]; default: 0;
 *  ch45 set
 */
#define SOC_ETM_CH_SET45    (BIT(13))
#define SOC_ETM_CH_SET45_M  (SOC_ETM_CH_SET45_V << SOC_ETM_CH_SET45_S)
#define SOC_ETM_CH_SET45_V  0x00000001U
#define SOC_ETM_CH_SET45_S  13
/** SOC_ETM_CH_SET46 : WT; bitpos: [14]; default: 0;
 *  ch46 set
 */
#define SOC_ETM_CH_SET46    (BIT(14))
#define SOC_ETM_CH_SET46_M  (SOC_ETM_CH_SET46_V << SOC_ETM_CH_SET46_S)
#define SOC_ETM_CH_SET46_V  0x00000001U
#define SOC_ETM_CH_SET46_S  14
/** SOC_ETM_CH_SET47 : WT; bitpos: [15]; default: 0;
 *  ch47 set
 */
#define SOC_ETM_CH_SET47    (BIT(15))
#define SOC_ETM_CH_SET47_M  (SOC_ETM_CH_SET47_V << SOC_ETM_CH_SET47_S)
#define SOC_ETM_CH_SET47_V  0x00000001U
#define SOC_ETM_CH_SET47_S  15
/** SOC_ETM_CH_SET48 : WT; bitpos: [16]; default: 0;
 *  ch48 set
 */
#define SOC_ETM_CH_SET48    (BIT(16))
#define SOC_ETM_CH_SET48_M  (SOC_ETM_CH_SET48_V << SOC_ETM_CH_SET48_S)
#define SOC_ETM_CH_SET48_V  0x00000001U
#define SOC_ETM_CH_SET48_S  16
/** SOC_ETM_CH_SET49 : WT; bitpos: [17]; default: 0;
 *  ch49 set
 */
#define SOC_ETM_CH_SET49    (BIT(17))
#define SOC_ETM_CH_SET49_M  (SOC_ETM_CH_SET49_V << SOC_ETM_CH_SET49_S)
#define SOC_ETM_CH_SET49_V  0x00000001U
#define SOC_ETM_CH_SET49_S  17

